[
  {
    "img": "background-image: url(/tmp/images/20231201-unnamed_5.width-800.png)",
    "date": "04.12.2023",
    "title": "Europoslankyně testuje AI aplikace: Které jsou fajn a na které si dát pozor?",
    "perex": "04.12.2023V rámci kampaně Píše se to AI jsem se rozhodla „vyzkoušet za vás“ pětici vybraných, spíše méně známých AI aplikací.\n\nV následujících řádcích se s vámi podělím o několik postřehů, které jsem si z téhle poměrně zábavné aktivity odnesla.\n\nTřeba se vám nějaká appka skutečně zalíbí, nebo vám pomůže, pobaví, anebo prostě ulehčí nějakou práci – aniž by ohrozila vaše osobní data. ;)",
    "content": "\n                <p data-block-key=\"e6xp8\"><a href=\"https://www.beatoven.ai/\"><b>Beatoven</b></a><br>Jako první upoutal mou pozornost Beatoven – snad proto, že se hudební tvorbě odjakživa věnuji se svou kapelou. Ano, jak název odkazující se na slavného skladatele napovídá, aplikace vám umožní tvořit hudbu! Ale nečekejte žádný Rihanny hit. Můžete si v ní vybrat hudební styl – od rocku, přes indie, až po hiphop. Svého „skladatele“ pak nasměrujete k určité „náladě“. Beatoven vám nabídne smutný vibe, intenzivní, radostný. Tempo písně bude pomalé, střední či rychlé. A pak už jen délka.<br></p><p data-block-key=\"e8bnb\">Můj „středně rychlý depresivní hiphop“ trvalo Beatovenovi vygenerovat cca 30 vteřin. A výsledek? Na poslech popravdě nic moc. Zvuk byl příliš primitivní, žádná záživné „dropy“. Hiphop to nicméně minimálně připomínalo. Pokud si svou písničku budete chtít stáhnout, budete si muset zaplatit. Ani druhý pokus moje hudební choutky příliš neuspokojil. „Rychlý radostný pop“ byl repetitivní, bez výrazných, zábavných změn či překvápek, které v hudbě hledáme.<br></p><p data-block-key=\"929qe\">Závěr? Chcete-li si vytvořit nerušivý ambient do pozadí videa bez poplatku za copyright, může vám Beatoven být nápomocen. I když, nutno říct, existují i databáze s kvalitnějšími počiny. Na tvorbu opravdové hudby zatím zůstanu u zkušebny s živou kapelou.<br></p><p data-block-key=\"dnhka\"><a href=\"https://www.memecam.io/\"><b>Memecam</b></a><br>Memecam je AI, která vám pomůže vyrobit memy. Nedá se říct, že by v nich absentoval humor, ale za břicho jsem se tedy taky smíchy nepopadala. Uživatelsky je to trochu otrava – nejde např. hýbat s textem ani fotkou, takže máte zpravidla zakryté tváře nebo nevhodně umístěný text, a musíte s tím tak buď počítat už při výběru fotografie, nebo to vzít jako součást kreativy.</p><p data-block-key=\"aha4p\"></p><img alt=\"20231201-unnamed (2)\" class=\"richtext-image left\" height=\"512\" src=\"/tmp/images/20231201-unnamed_2.width-1300.png\" width=\"504\"><p data-block-key=\"8slf1\"></p><img alt=\"20231201-unnamed (3)\" class=\"richtext-image left\" height=\"510\" src=\"/tmp/images/20231201-unnamed_3.width-1300.png\" width=\"512\"><p data-block-key=\"389q8\"></p><img alt=\"20231201-unnamed (4)\" class=\"richtext-image left\" height=\"502\" src=\"/tmp/images/20231201-unnamed_4.width-1300.png\" width=\"512\"><p data-block-key=\"136lv\"></p><p data-block-key=\"eiekn\">Pokud si nicméně memík v malování nebo jiném generátoru vytvoříte i sami a chcete jen nějaký absurdní vtípek nebo „stěr“, na inspiraci dobré!<br></p><p data-block-key=\"4m2iu\"><a href=\"https://stockimg.ai/\"><b>Stockimg</b></a><br>Tahle appka vám pomůže vytvořit tapetu, logo, přebal knihy, mobilní ikonu, plakát, ilustraci, ale i uživatelské rozhraní pro váš web – alespoň podle výčtu v jejich nabídce. Takhle lákavý výběr mě zaujal, a tak jsem se odvážně vrhla do přebalu knihy. Požádala jsem Stockimg, aby mi vyrobil „obal knihy s názvem VIZE PRO EVROPU, který je o evropské federaci; obal by neměl být modrý a měl by být kreativní, moderní, maximalistický“ (přeloženo z angličtiny, česky aplikace neumí).</p><p data-block-key=\"1933h\"></p><img alt=\"20231201-unnamed (1)\" class=\"richtext-image left\" height=\"307\" src=\"/tmp/images/20231201-unnamed_1.width-1300.png\" width=\"512\"><p data-block-key=\"f378p\"></p><p data-block-key=\"1c3gl\">A narazila jsem spíše na trable. Stockimg sice slibuje vyrobit návrh na knihu, ale… neumí generovat text. Místo Vize pro Evropu tam tak byl typicky děsivý paskvil a napodobenina slov, kterou umí jen AI. Nepochopila také, že si nepřeji, aby byl modrý, hapruje už tedy samotné porozumění jednoduchému zadání. A ani požadovaný maximalismus jsem ve výsledném návrhu nenašla, jen pár barevných tvarů. Neplacená verze vám umožní jen jeden prompt denně.</p><p data-block-key=\"1p27s\"></p><img alt=\"20231201-unnamed\" class=\"richtext-image left\" height=\"352\" src=\"/tmp/images/20231201-unnamed.width-1300.png\" width=\"356\"><p data-block-key=\"de4cs\"></p><p data-block-key=\"fgkhe\">Závěr? Stockimg rozhodně nebude „brát lidem práci“, a to ani v ideové rovině. Placenou verzi jsem nezkoušela – prostě proto, že ta neplacená mě na ni nedokázala ani zdálky nalákat.<br></p><p data-block-key=\"3p3p6\"><a href=\"https://scribblediffusion.com/\"><b>Scribble Diffusion</b></a><br>Můj vítěz – jediná z volných aplikací, o kterých můžu s čistým svědomím říct, že ji pravděpodobně použiju i v budoucnu. Zadáte písemně, co kreslíte a jak byste chtěli, aby to bylo laděno („tříbrevná kočka v trávě“), a následně to hrubými obrysy nakreslíte. AI pak chvílí rotuje a kalkuluje, až vám zadání splní v mnohem vyšší kvalitě, než v jaké jste to sami nakreslili. Výsledky jsou hezké, a často i vtipné.</p><p data-block-key=\"fu26\"></p><img alt=\"20231201-unnamed (5)\" class=\"richtext-image left\" height=\"303\" src=\"/tmp/images/20231201-unnamed_5.width-1300.png\" width=\"512\"><p data-block-key=\"b3v4c\"></p><p data-block-key=\"de05m\">Vnímám velký potenciál zejména pro ty, kdo si umí nakreslit základní obrázek (např. s pomocí myši, nebo pokud mají tablet s perem) ve slušné kvalitě – v takových případech vám totiž Scribble Diffusion pomůže váš výtvor zdokonalit, vyčistit, zpřesnit a obohatit. Rozhodně bych po ní doporučovala sáhnout ve chvíli, kdy se vám něco nedaří vygenerovat ve známější MidJourney.<br></p><p data-block-key=\"duld9\"><a href=\"https://fireflies.ai/\"><b>Fireflies</b></a><br>Jako příklad špatné praxe se naopak ukázala aplikace Fireflies. Na svých stránkách slibuje: Přepisujte, shrnujte, prohledávejte a analyzujte všechny své hlasové konverzace. Jako někdo, kdo má denně množství videohovorů (jak parlamentních, tak vnitrostranických) to upřímně zní jako spása – nikdo nedělá rád zápisy z callů.<br></p><p data-block-key=\"dof79\">Než jsem však mohla začít prozkoumávat její schopnosti, chtěla po mně přístup do všech mých (Google) kalendářů. To je pro mě naprosto nadbytečný požadavek, navíc pro začátek jejího používání. I pokud by byla kompatibilní pouze s Google Meet (což se tam nikde nepíše), nepotřebuje hloubkový přístup ke mně do kalendáře, potřebuje jen běžet zapnutý, jakmile se na call připojím.<br></p><p data-block-key=\"c9ul9\">Volnou verzi navíc nebylo možné spustit bez údajů z platební karty, přestože appka nabízí prvních 7 dní zdarma. V tu chvíli by se měla rozsvítit kontrolka.<br></p><p data-block-key=\"2jeng\">Neříkám, že hned začne údaje zneužívat (i když i na to byste se měli dát pozor – ještě vám neposkytla absolutně žádnou službu a už žádá osobní i platební údaje), ale i pokud by to byla důvěryhodná aplikace, je manipulativní chtít platební údaje už před trialem.<br></p><p data-block-key=\"8sc9k\">Aplikace typicky počítá s tím, že na ní za týden můžete zapomenout a bude vám nějakou dobu strhávat drobné měsíční platby, než si to zkontolujete. Tomu se říká sociální inženýrství a jedná se o nekalou praktiku.<br></p><p data-block-key=\"8umo6\">Můj poslední apel tedy bude znít asi následovně:<br></p><p data-block-key=\"1os6o\">Aplikace s AI jsou sexy a nové a chtěné a některé určitě přinesou zjednodušení našemu životu. Generování textu a obrázků určitě nadchne mnohé z vás, co pracují v marketingu, administrativě nebo prostě za počítačem. Dávejte si proto o to větší pozor na podvodníky, kteří se jen pokusí svézt na této vlně obliby AI a zneužít vaše soukromá data či dokonce peníze.</p>\n              "
  }
]